docs/roam/20220601131312-vae.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>VAE</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">VAE</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org235dc21">Way of VAE</a>
<ul>
<li><a href="#orge09fce2">maximum likelihood of the data distribution, with latent space of a minimal prior information</a>
<ul>
<li><a href="#orgbd2011c">KL-divergence is indirect</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc7f9102">property</a>
<ul>
<li><a href="#org50263cd">prioar \(p(z)\) has an impact, Gaussiana as prior has the maximal entropy and thus minimizaion of the prior information.</a></li>
<li><a href="#orga7cd842">\(p_{\theta}(z|x)\) and \(q_{\phi}(z|x)\) will be finally very simimlar thus can be ignored.</a></li>
<li><a href="#org5a27f90">encoder part use KL-Divergence, Decoder data maximum likelihood</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org235dc21" class="outline-2">
<h2 id="org235dc21">Way of VAE</h2>
<div class="outline-text-2" id="text-org235dc21">
</div>
<div id="outline-container-orge09fce2" class="outline-3">
<h3 id="orge09fce2">maximum likelihood of the data distribution, with latent space of a minimal prior information</h3>
<div class="outline-text-3" id="text-orge09fce2">
</div>
<div id="outline-container-orgbd2011c" class="outline-4">
<h4 id="orgbd2011c">KL-divergence is indirect</h4>
</div>
</div>
</div>
<div id="outline-container-orgc7f9102" class="outline-2">
<h2 id="orgc7f9102">property</h2>
<div class="outline-text-2" id="text-orgc7f9102">
</div>
<div id="outline-container-org50263cd" class="outline-3">
<h3 id="org50263cd">prioar \(p(z)\) has an impact, Gaussiana as prior has the maximal entropy and thus minimizaion of the prior information.</h3>
</div>
<div id="outline-container-orga7cd842" class="outline-3">
<h3 id="orga7cd842">\(p_{\theta}(z|x)\) and \(q_{\phi}(z|x)\) will be finally very simimlar thus can be ignored.</h3>
</div>
<div id="outline-container-org5a27f90" class="outline-3">
<h3 id="org5a27f90">encoder part use KL-Divergence, Decoder data maximum likelihood</h3>
<div class="outline-text-3" id="text-org5a27f90">
<p>
<a href="./20211221093832-gan.html">GAN</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
